-- MySQL dump 10.13  Distrib 5.7.9, for Win64 (x86_64)
--
-- Host: localhost    Database: project
-- ------------------------------------------------------
-- Server version	5.7.10-log

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `lift`
--

DROP TABLE IF EXISTS `lift`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `lift` (
  `S_id` int(11) NOT NULL AUTO_INCREMENT,
  `S_line` varchar(255) DEFAULT NULL,
  `S_name` varchar(255) DEFAULT NULL,
  `enter_num` int(11) DEFAULT NULL,
  `S_position` varchar(255) DEFAULT NULL,
  `start_floor` varchar(255) DEFAULT NULL,
  `end_floor` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`S_id`)
) ENGINE=InnoDB AUTO_INCREMENT=166 DEFAULT CHARSET=euckr;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `lift`
--

LOCK TABLES `lift` WRITE;
/*!40000 ALTER TABLE `lift` DISABLE KEYS */;
INSERT INTO `lift` VALUES (1,'1호선','서울역',NULL,'내부 C 계단','지하1층','지하2층'),(2,'1호선','신설동',1,'1번 출구','지상1층','지하1층'),(3,'1호선','신설동',6,'6번 출구','지하1층','지상1층'),(4,'1호선','신설동',NULL,'대합실 연결통로','지하1층','지하1층'),(5,'1호선','신설동',NULL,'대합실 연결통로','지하1층','지하1층'),(6,'1호선','청량리(서울시립대입구)',NULL,'제기동측 승강장','지하1층','지하2층'),(7,'1호선','청량리(서울시립대입구)',NULL,'섬식(상)8-2','지하1층','지하2층'),(8,'2호선','건대입구',NULL,'외선승강장 종점측','지상3층','지상2층'),(9,'2호선','삼성(무역센터)',NULL,'코엑스측 연결계단','지하1층','지하1층'),(10,'2호선','성수',NULL,'외선승강장 시점측','지상3층','지상2층'),(11,'2호선','성수',NULL,'내선승강장 시점측','지상3층','지상2층'),(12,'2호선','신당',NULL,'4번 출입구','지상1층','지하1층'),(13,'2호선','왕십리',NULL,'6번 출입구','지상1층','지하1층'),(14,'2호선','잠실(송파구청)',NULL,'상가측 연결계단','지하1층','지하1층'),(15,'2호선','한양대',NULL,'섬식(외) 3-3','지상2층','지상1층'),(16,'3호선','고속터미널',NULL,'2층 대합실 중앙','지하1층','지하2층'),(17,'3호선','교대(법원·검찰청)',NULL,'B1층 2,3호선 연결 계단','지하1층','지하1층'),(18,'3호선','옥수',NULL,'상선종점 D계단','지상4층','지상3층'),(19,'3호선','옥수',NULL,'하선종점 E계단','지상4층','지상3층'),(20,'3호선','종로3가',NULL,'7번 출입구','지상1층','지하1층'),(21,'3호선','종로3가',NULL,'을지3가측 2-3층','지하2층','지하3층'),(22,'3호선','종로3가',NULL,'을지3가측 1-2층','지하1층','지하2층'),(23,'4호선','동대문',NULL,'1, 4호선(환승통로)','지하1층','지하1층'),(24,'4호선','명동',NULL,'B2 - B3층 승강장','지하2층','지하3층'),(25,'4호선','명동',NULL,'B1-B2 대합실','지하1층','지하2층'),(26,'4호선','사당',NULL,'승강장 X-32','',''),(27,'4호선','상계',NULL,'상행 3-1','지상3층','지상2층'),(28,'4호선','상계',NULL,'하행 8-3','지상3층','지상2층'),(29,'4호선','서울역',9,'9-1번 출구 교통섬','지상1층','지하1층'),(30,'4호선','신용산',NULL,'2번 출입구','지상1층','지하1층'),(31,'4호선','이촌(국립중앙박물관)',NULL,'','',''),(32,'4호선','창동',NULL,'상선승강장, C계단','',''),(33,'4호선','창동',NULL,'하선승강장, D계단','',''),(34,'4호선','창동',2,'2번출구 1호선 연결통로','',''),(35,'4호선','창동',NULL,'1호선 상선측 승강장','',''),(36,'4호선','창동',NULL,'1호선 하선측 승강장','',''),(37,'4호선','창동',1,'1번출구 1호선 연결통로','',''),(38,'4호선','충무로',NULL,'3호선승강장-4호선 대합실','',''),(39,'4호선','회현(남대문시장)',NULL,'5번 출입구','지상1층','지하1층'),(40,'5호선','강동',NULL,'지하 상선승강장','',''),(41,'5호선','강동',NULL,'지하 대합실','',''),(42,'5호선','광나루(장신대)',NULL,'지하','',''),(43,'5호선','광화문(세종문화회관)',NULL,'지하','',''),(44,'5호선','광화문(세종문화회관)',NULL,'지하 종점','',''),(45,'5호선','광화문(세종문화회관)',NULL,'지하','',''),(46,'5호선','광화문(세종문화회관)',3,'3번출구','',''),(47,'5호선','까치산',NULL,'지하 상선B5-B4','지하4층','지하5층'),(48,'5호선','까치산',NULL,'지하 하선B4-B5','지하5층','지하4층'),(49,'5호선','까치산',2,'2번출구','지하1층','지상1층'),(50,'5호선','답십리',NULL,'지하','',''),(51,'5호선','동대문역사문화공원',NULL,'지하 승강장#1','',''),(52,'5호선','동대문역사문화공원',6,'6번출구','',''),(53,'5호선','마장',NULL,'지하','',''),(54,'5호선','마장',1,'1번출구','',''),(55,'5호선','마천',NULL,'지하 B4-B2','지하2층','지하4층'),(56,'5호선','마천',NULL,'지하 1-13','',''),(57,'5호선','마천',1,'1번출구','',''),(58,'5호선','상일동',NULL,'지하','',''),(59,'5호선','상일동',NULL,'지하','',''),(60,'5호선','상일동',4,'4번출구','',''),(61,'5호선','서대문',5,'지하 5,6번 출구','',''),(62,'5호선','신길',NULL,'지하 상선승환통로','',''),(63,'5호선','신길',NULL,'지하 환승통로','',''),(64,'5호선','영등포구청',NULL,'지하 상선승환통로','',''),(65,'5호선','영등포구청',NULL,'지하 환승통로','',''),(66,'5호선','장한평',NULL,'지하','',''),(67,'5호선','종로3가(탑골공원)',NULL,'지하','',''),(68,'6호선','공덕',NULL,'지하 5,6호선 환승통로','',''),(69,'6호선','공덕',NULL,'지하 공항철도 환승통로(응암방면)','',''),(70,'6호선','공덕',NULL,'지하 공항철도 환승통로(봉화산 방면)','',''),(71,'6호선','광흥창(서강)',4,'지하 4번출구','',''),(72,'6호선','구산',NULL,'지하 지하1층','',''),(73,'6호선','대흥(서강대앞)',NULL,'지하 내부용','',''),(74,'6호선','대흥(서강대앞)',2,'2번출구','',''),(75,'6호선','동묘앞',NULL,'지하','',''),(76,'6호선','동묘앞',5,'5번출구','',''),(77,'6호선','디지털미디어시티',NULL,'지하','',''),(78,'6호선','디지털미디어시티',NULL,'지하','',''),(79,'6호선','디지털미디어시티',3,'3번출구','',''),(80,'6호선','마포구청',NULL,'지하 B2~B3','지하3층','지하2층'),(81,'6호선','마포구청',NULL,'지하 지하1층','',''),(82,'6호선','마포구청',NULL,'지하','',''),(83,'6호선','마포구청',6,'지하 외부출구#6','',''),(84,'6호선','보문',NULL,'지하 내부용','',''),(85,'6호선','보문',1,'1번출구','',''),(86,'6호선','봉화산(서울의료원)',NULL,'B1-B2','지하층','지하1층'),(87,'6호선','봉화산(서울의료원)',NULL,'B1-B2','지하층','지하1층'),(88,'6호선','불광',NULL,'지하 지하1층','',''),(89,'6호선','불광',NULL,'지하 지하1층','',''),(90,'6호선','삼각지',NULL,'지하 내부계단(승환홀)','',''),(91,'6호선','삼각지',NULL,'지하 내부계단(승환홀)','',''),(92,'6호선','삼각지',7,'7번출구','',''),(93,'6호선','상수',NULL,'지하 지하1층','',''),(94,'6호선','상수',4,'4번출구','',''),(95,'6호선','상월곡(한국과학기술연구원)',NULL,'내부용','',''),(96,'6호선','상월곡(한국과학기술연구원)',NULL,'내부용','',''),(97,'6호선','새절(신사)',NULL,'지하 지하1층','',''),(98,'6호선','석계',NULL,'지하 B2-B3','지하3층','지하2층'),(99,'6호선','석계',NULL,'B2-B3','지하3층','지하2층'),(100,'6호선','신당',NULL,'지하 6호선승환용','',''),(101,'6호선','신당',NULL,'지하 승환홀','',''),(102,'6호선','신당',NULL,'지하 2호선환승','',''),(103,'6호선','신당',NULL,'지하 2호선환승','',''),(104,'6호선','신당',9,'9번출구','',''),(105,'6호선','월곡(동덕여대)',NULL,'B1-B2','지하2층','지하1층'),(106,'6호선','합정',NULL,NULL,'',''),(107,'6호선','효창공원앞',1,'1번출구','',''),(108,'6호선','효창공원앞',3,'3번출구','',''),(109,'7호선','가산디지털단지',NULL,'지하 W/L-5','',''),(110,'7호선','가산디지털단지',2,'지하 #2,3번 출구계단','',''),(111,'7호선','가산디지털단지',3,'3번출구','',''),(112,'7호선','가산디지털단지',NULL,'지상환승','',''),(113,'7호선','강남구청',NULL,'지하 휠체어-1','',''),(114,'7호선','건대입구',NULL,'지하 장암방면','',''),(115,'7호선','건대입구',NULL,'지하 온수방향','',''),(116,'7호선','건대입구',5,'5번출구','',''),(117,'7호선','건대입구',NULL,'지하 병원연결-2','',''),(118,'7호선','건대입구',3,'3번출구','',''),(119,'7호선','고속터미널',NULL,'지하 휠체어-1','',''),(120,'7호선','고속터미널',NULL,'지하 휠체어-06','',''),(121,'7호선','고속터미널',NULL,'지하 휠체어-07','',''),(122,'7호선','고속터미널',NULL,'지하 휠체어-08','',''),(123,'7호선','광명사거리',NULL,'지하 승강장','',''),(124,'7호선','남구로',NULL,'지하 W/L-1','',''),(125,'7호선','남구로',NULL,'지하 W/L-2','',''),(126,'7호선','남구로',NULL,'지하 W/L-3','',''),(127,'7호선','남구로',NULL,'지하 W/L-4','',''),(128,'7호선','남구로',NULL,'지하 W/L-5','',''),(129,'7호선','남구로',NULL,'지하 W/L-6','',''),(130,'7호선','남구로',NULL,'지하 W/L-7','',''),(131,'7호선','남구로',6,'6번출구','',''),(132,'7호선','남구로',NULL,'지하 W/L-9','',''),(133,'7호선','남구로',4,'4번출구','',''),(134,'7호선','남구로',NULL,'지하 W/L-11','',''),(135,'7호선','논현',NULL,'지하 휠체어-1','',''),(136,'7호선','대림(구로구청)',NULL,'지상환승','',''),(137,'7호선','마들',NULL,'지하 1-3','',''),(138,'7호선','반포',NULL,'지하','',''),(139,'7호선','수락산',NULL,'지하 도봉산방향','',''),(140,'7호선','수락산',NULL,'지하 온수방향','',''),(141,'7호선','어린이대공원(세종대)',NULL,NULL,'',''),(142,'7호선','온수(성공회대입구)',NULL,'지하 W/L-8','',''),(143,'7호선','온수(성공회대입구)',NULL,'지하 W/L-3','',''),(144,'7호선','온수(성공회대입구)',NULL,'지상환승','지하1층','지상1층'),(145,'7호선','온수(성공회대입구)',NULL,'지상환승','지하1층','지상1층'),(146,'7호선','온수(성공회대입구)',NULL,'지상환승','지하1층','지상1층'),(147,'7호선','청담',NULL,'지하 휠체어-3','',''),(148,'7호선','청담',NULL,'지하 휠체어-4','',''),(149,'7호선','총신대입구(이수)',NULL,'지하 W/L-1','',''),(150,'7호선','총신대입구(이수)',NULL,'지하 W/L-2','',''),(151,'7호선','총신대입구(이수)',NULL,'지하 W/L-3','',''),(152,'7호선','총신대입구(이수)',NULL,'지하 W/L-4','',''),(153,'8호선','남한산성입구(성남법원·검찰청)',4,'4번출구','지하1층','지상1층'),(154,'8호선','남한산성입구(성남법원·검찰청)',4,'지하 4번출구-2','',''),(155,'8호선','모란',NULL,'지하 환승수진측','',''),(156,'8호선','모란',NULL,'지하 환승복정측','',''),(157,'8호선','복정',3,'3번출구','',''),(158,'8호선','수진',3,'3번출구','지하1층','지상1층'),(159,'8호선','잠실(송파구청)',NULL,'지하 1-5','',''),(160,'8호선','잠실(송파구청)',NULL,'지하 1-6','',''),(161,'8호선','잠실(송파구청)',NULL,'지하 1-7','',''),(162,'8호선','천호(풍납토성)',NULL,'지하 1-1','',''),(163,'8호선','천호(풍납토성)',NULL,'지하 1-2','',''),(164,'8호선','천호(풍납토성)',NULL,'지하 1-3','',''),(165,'8호선','천호(풍납토성)',NULL,'지하 1-4','','');
/*!40000 ALTER TABLE `lift` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2021-12-05 16:27:56
